# **************************************************************************** #
#                                                                              #
#                                                         :::      ::::::::    #
#    Makefile                                           :+:      :+:    :+:    #
#                                                     +:+ +:+         +:+      #
#    By: mayoub <mayoub@student.42.fr>              +#+  +:+       +#+         #
#                                                 +#+#+#+#+#+   +#+            #
#    Created: 2022/03/24 13:22:13 by Palmi             #+#    #+#              #
#    Updated: 2022/11/22 15:53:37 by mayoub           ###   ########.fr        #
#                                                                              #
# **************************************************************************** #

# Compilation variables
CC		:= gcc
FLAGS	:= -Lvendor/readline/lib -lreadline# -fsanitize=address
CFLAGS	:= -Werror -Wextra -Wall 

# Name of the final executable
NAME	:= minishell

# All needed files
SRC		:=	src/env.c \
			src/main.c \
			src/utils.c \
			src/lexer.c \
			src/variable.c \
			src/signal.c \
			src/minishell.c \
			src/error/error.c \
			src/builtins/echo.c \
			src/builtins/env.c \
			src/builtins/export.c \

OBJ		:= $(SRC:.c=.o)

# All needed library
LIB		:=	src/libft/libft.a \
			src/printf/printf.a \

# Colors for differents prints
GREEN	:= "\033[0m\033[1;32m"
CYAN	:= "\033[0m\033[1;36m"
YELLOW	:= "\033[0m\033[1;33m\033[3;33m"
RESET	:= "\033[0m"

# Compile all .c files
.c.o: $(SRC)
	@printf $(GREEN)"\r\033[KCompiling objects... "$(YELLOW)"<$<> ⏳ "$(RESET)
	@$(CC) $(CFLAGS) -c $< -o $(<:.c=.o)

# Compile all .o files
$(NAME): $(OBJ)
	@printf $(GREEN)"\r\033[KObjects compiled succesfully ✅\n"$(RESET)
	@make -C src/libft
	@make -C src/printf
	@printf $(CYAN)"\r\033[KCompiling '$(NAME)'... ⏳"$(RESET)
	@$(CC) $(FLAGS) $(OBJ) $(LIB) -I include/ -o $(NAME)
	@printf $(GREEN)"\r\033[KSuccess compiling '$(NAME)' ✅\n"$(RESET)
	@printf "\n"
	@printf "███╗   ███╗██╗███╗   ██╗██╗███████╗██╗  ██╗███████╗██╗     ██╗\n"
	@printf "████╗ ████║██║████╗  ██║██║██╔════╝██║  ██║██╔════╝██║     ██║\n"
	@printf "██╔████╔██║██║██╔██╗ ██║██║███████╗███████║█████╗  ██║     ██║\n"
	@printf "██║╚██╔╝██║██║██║╚██╗██║██║╚════██║██╔══██║██╔══╝  ██║     ██║\n"
	@printf "██║ ╚═╝ ██║██║██║ ╚████║██║███████║██║  ██║███████╗███████╗███████╗\n"
	@printf "╚═╝     ╚═╝╚═╝╚═╝  ╚═══╝╚═╝╚══════╝╚═╝  ╚═╝╚══════╝╚══════╝╚══════╝\n"
	@printf "\n"
	@printf "██████╗  ██████╗ ██╗     ███╗   ██╗ █████╗ ██████╗ ███████╗███████╗███████╗\n"
	@printf "██╔══██╗██╔═══██╗██║     ████╗  ██║██╔══██╗██╔══██╗██╔════╝██╔════╝██╔════╝\n"
	@printf "██████╔╝██║   ██║██║     ██╔██╗ ██║███████║██████╔╝█████╗  █████╗  █████╗\n"
	@printf "██╔═══╝ ██║   ██║██║     ██║╚██╗██║██╔══██║██╔══██╗██╔══╝  ██╔══╝  ██╔══╝\n"
	@printf "██║     ╚██████╔╝███████╗██║ ╚████║██║  ██║██║  ██║███████╗██║     ██║\n"
	@printf "╚═╝      ╚═════╝ ╚══════╝╚═╝  ╚═══╝╚═╝  ╚═╝╚═╝  ╚═╝╚══════╝╚═╝     ╚═╝\n"
	@printf "\n"

# Default command to launch
all: vendor/readline $(NAME)

# Compile and run minishell
run: all
	@./$(NAME)

# Vendor
vendor:
	@mkdir vendor

# Readline
vendor/readline: vendor
	@printf $(CYAN)"\r\033[KInstallation of readline... ⏳\n"$(RESET)
	@sh install_readline.sh
	@printf $(GREEN)"Readline installed ✅\n"$(RESET)

shortcut:
	@open https://www.google.com/search?q=how+to+become+a+good+developer+%3F&rlz=1C5CHFA_enFR1031FR1031&ei=typxY8mBN-yUxc8Pm6CB4Ak&ved=0ahUKEwiJudLQ2Kv7AhVsSvEDHRtQAJwQ4dUDCA8&uact=5&oq=how+to+become+a+good+developer+%3F&gs_lcp=Cgxnd3Mtd2l6LXNlcnAQAzIHCAAQgAQQEzIGCAAQHhATMgYIABAeEBMyBggAEB4QEzIICAAQCBAeEBMyCAgAEAgQHhATMggIABAIEB4QEzIICAAQCBAeEBMyCAgAEAgQHhATMggIABAIEB4QEzoKCAAQRxDWBBCwAzoJCAAQgAQQDRATOggIABAeEA0QEzoICAAQFhAeEBNKBAhNGAFKBAhBGABKBAhGGABQhgpYnDJgvTdoAXABeACAAWaIAe0BkgEDMi4xmAEAoAEByAEIwAEB&sclient=gws-wiz-serp

# Print our god
polnareff:
	@echo ""
	@echo "                            . ...**/##/***.,,*,                                 "
	@echo "                        ,.****//(#(#.###%((//(###(*/*(/*                        "
	@echo "                  .,.,,.*/((#%#(&((%%/*&&&#(//(/(##//(//((                      "
	@echo "                ,,,,.,,*//#/%###%#%(#(%&&/(##((##/*#(/**((((*                   "
	@echo "               .,,.*,*/,*/%(#&##%(/(%%(((#(#((//////(/(/*(//(//                 "
	@echo "              .,.,.,/..//,,/,/#%((#(**//////#((///(/*#//,/(//////               "
	@echo "            ,....,,*/.,.*/(#*/%#(//*(*///(/(#/#*(%,/,/#(/**/*/((/*.             "
	@echo "            .....,,*,**,*((*/,#((/(,*,,*/.(**(/,///////(((#(*(./(/(/            "
	@echo "           ...,,*,.,././//////,///*/*/,,,,..,*,*//(((,/##/(//*/,(#(**.          "
	@echo "           ...,*,,,,/**(/,.,*(*/,**.,**,.,****,,*/***,**((##(##*(*//*/          "
	@echo "          ..,...,.***/*,,..*,***,*,,.,,,.*,*/*,*,,*/*,****/*/#(*(///,,,         "
	@echo "         .,..,/.,*,**/,/,*/,***,*/,*,.,,.,..,,.****/,*******///*/(**//**        "
	@echo "          .,,,,*,(/*,//*****/*,,*******//*,**//**,**(/,***/(*,*((***/*,**.      "
	@echo "          ,.*.**,*((*,((#((/(##//////(#%%*. ./(#%###(...*,**((#,***,*****       "
	@echo "          ,,..//(/,,,,,**,.  .*(&&*...*&&&@@@@&@@&&&&.,*%/*/((//**(/////*,      "
	@echo "       .....,,*/***#@@@@@@@@@&%,,.....%#&@@&&@&&&%&&@. (%//,***,,/*((,,**,.     "
	@echo "        .,.,,**/(#*,%&@@@@@@@&&% *,.,..%%%%%%%%%&&%(..,*(***///*.(*/*/,,,**     "
	@echo "         .,.,,.**#(.*(&&&&&&%%%&.*,.... .*(((*,   *#(,,,/****#//,,****.*,,.     "
	@echo "          ,..,,,**/(#* .*/(*. .//,,..,.../(#####(/*,,,,/****,**./(/,/**,,*      "
	@echo "            ,.,*,***(#%(#####%#%%/*,,*#*....,..,,,,,,,,//(/*/(/,.///****,,.     "
	@echo "            .,...,,/*((((##(//(#%%%%%*.,,,...,,,,,,,,,,*(&//(%/(*,(/******,.    "
	@echo "            ..,..,,,**/*(#((//(##((*,///*,,*/,,,,,,,,**/%(&%(//#////********.   "
	@echo "             .,,,,//**////(#(((#%%(/*,,,,,,,,,*******/((#%/%&/(*/**/////**,,    "
	@echo "               ..,,,,.*/*(#/(#(#((((////**,,,,,,***/#(//#&&%%(*,(,***,**/**//   "
	@echo "               .,..,,.,**(####(#(/*,,,,,.,.,,,,*((#(//*/(%#%/(/**//,,,,,*/*///(("
	@echo "               ...,..,,,*(((/#%#(((/*********((##(//****/(##(/*,/,,*,*,,*,//////"
	@echo "               ,,,,**,,*/(##(&%###%########%%##(/********/(/((/**,**,,**////(///"
	@echo "         .......*(**#**/*//((&&#(%%%%##%%%%##(//****,,***/(///*.,,,*,*((/(//((//"
	@echo "   ..........,,..,#%%##%&&%%&&&&(##@@&&%%%%%#((/****,,****/(/*,*,,,*#(((/((//(/("
	@echo ""

# Just a cute loading bar
load:
	@printf '\r █▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒ - 0%%\r'
	@sleep .01
	@printf '\r ██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒ - 5%%\r'
	@sleep .01
	@printf '\r ███▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒ - 10%%\r'
	@sleep .01
	@printf '\r ████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒ - 15%%\r'
	@sleep .01
	@printf '\r █████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒ - 20%%\r'
	@sleep .01
	@printf '\r ██████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒ - 25%%\r'
	@sleep .01
	@printf '\r ███████▒▒▒▒▒▒▒▒▒▒▒▒▒▒ - 30%%\r'
	@sleep .01
	@printf '\r ████████▒▒▒▒▒▒▒▒▒▒▒▒▒ - 35%%\r'
	@sleep .01
	@printf '\r █████████▒▒▒▒▒▒▒▒▒▒▒▒ - 40%%\r'
	@sleep .01
	@printf '\r ██████████▒▒▒▒▒▒▒▒▒▒▒ - 45%%\r'
	@sleep .01
	@printf '\r ███████████▒▒▒▒▒▒▒▒▒▒ - 50%%\r'
	@sleep .01
	@printf '\r ████████████▒▒▒▒▒▒▒▒▒ - 55%%\r'
	@sleep .01
	@printf '\r █████████████▒▒▒▒▒▒▒▒ - 60%%\r'
	@sleep .01
	@printf '\r ██████████████▒▒▒▒▒▒▒ - 65%%\r'
	@sleep .01
	@printf '\r ███████████████▒▒▒▒▒▒ - 70%%\r'
	@sleep .01
	@printf '\r ████████████████▒▒▒▒▒ - 75%%\r'
	@sleep .01
	@printf '\r █████████████████▒▒▒▒ - 80%%\r'
	@sleep .01
	@printf '\r ██████████████████▒▒▒ - 85%%\r'
	@sleep .01
	@printf '\r ███████████████████▒▒ - 90%%\r'
	@sleep .01
	@printf '\r ████████████████████▒ - 95%%\r'
	@sleep .01
	@printf '\r █████████████████████ - 100%%\r'
	@sleep .08

# Clean all .o and .a files
clean:
	@printf $(CYAN)"\r\033[KErasing objects... "$(RESET)"⏳ "
	@rm -rdf $(OBJ)
	@make -C src/libft clean
	@make -C src/printf clean
	@printf $(GREEN)"\r\033[Kcleaned 🗑\n"$(RESET)

# Same as 'clean' but clean minishell too
fclean:
	@printf $(CYAN)"\r\033[KErasing objects... "$(RESET)"⏳ "
	@rm -rdf $(OBJ)
	@make -C src/libft fclean
	@make -C src/printf fclean
	@printf $(GREEN)"\r\033[KObjects cleaned 🗑\n"$(RESET)
	@printf $(CYAN)"\r\033[KErasing binary file... "$(RESET)"⏳ "
	@rm -rdf $(NAME) test_parser
	@printf $(GREEN)"\r\033[KBinary file cleaned 🗑\n"$(RESET)
	@printf $(GREEN)"\r\033[KForce cleaned 🗑\n"$(RESET)

# Clean readline
fclean_readline:
	@printf $(CYAN)"\r\033[KErasing readline... "$(RESET)"⏳ "
	@rm -rdf vendor
	@printf $(GREEN)"\r\033[KReadline cleaned 🗑\n"$(RESET)

# Clean all and recompile minishell
re: fclean all

.PHONY: all clean fclean re polnareff load fclean_readline run
